# 1) Репозиторий - хранилище проекта, код, документация и тд.
# 2) Ветка - независимая линия разработки, полезная вещь
# 3) Коммит - сохранение, чекпоинт в программе
# 4) Пуш - отправка локальных изменений в удаленный репозиторий, то бишь на гитхуб

# Комманды

# git init - инициализирует новый репозиторий
# git clone <ссылка> - клонирует удаленный репозиторий
# git status - показывает состояние каждого файла в рабочей папке
# git add <файл> ИЛИ git add . - добавляет файлы в учет для следующего коммита
# git commit -m 'сообщение / описание' - фиксирует изменения в репозитории
# git push - отправляет изменения в удалённый репозиторий
# git checkout <имя ветки> - переключается на указанную ветку